about.org
#+TITLE:About
#+OPTIONS: num:0
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

* 这里是 Ilghar Kus 的博客。

我的通用ID是 =ilghar_kus= ，或 =ilgharkus= 。在某些成员比较少的社区，我也会使用 =ika= 。

我现在还是学生。

我感兴趣的是信息安全，自由软件，数学，金属乐以及一些复古的事物。

我使用 =Gentoo= 和 =FreeBSD= 作为工作的主力系统，使用 =GNU Emacs= 作为代码编辑器、写作软件以及GTD软件。

#+BEGIN_QUOTE
What's your favourite...
1. *operating system*

   Gentoo.
2. *text editor*

   GNU Emacs.
3. *programming language*

   Bash for quick scripts; Perl for hacky scripts; Haskell for math & FP; C for Universal.
4. *web browser*

   Nyxt; Links; Firefox for compatibility.
5. *command-line shell*

   Bash.

i hope ure happy now [[https://sqt.wtf/~ullard/the-five-questions.html][ullard]].
#+END_QUOTE

我使用 Dell Inspiron 7590 和一台 Thinkpad T480s 作为主力工作站，使用 =i3wm= 以及 =polybar= 。

我使用中文和英文写作。

我的个人邮箱是 =ilghar_kus [at] protonmail.com= 。欢迎你来信，当然推荐使用PGP进行加密。

我的PGP指纹为 =1A64866B328C6A9092F02DD11C360F7878D2377B= ， 你可以在[[./ilghar_kus.asc][这里]]下载我的公钥。

* 你可以在这里找到我
- [[https://gitlab.com/ilghar_kus][GitLab]]
- [[https://mastodon.sdf.org/@ika][Mastodon]]
