public/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-04-29 Fri 16:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style/main.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">About</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdf7cbf7">这里是 Ilghar Kus 的博客。</a></li>
<li><a href="#org47bf438">你可以在这里找到我</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf7cbf7" class="outline-2">
<h2 id="orgdf7cbf7">这里是 Ilghar Kus 的博客。</h2>
<div class="outline-text-2" id="text-orgdf7cbf7">
<p>
我的通用ID是 <code>ilghar_kus</code> ，或 <code>ilgharkus</code> 。在某些成员比较少的社区，我也会使用 <code>ika</code> 。
</p>

<p>
我现在还是学生。
</p>

<p>
我感兴趣的是信息安全，自由软件，数学，金属乐以及一些复古的事物。
</p>

<p>
我使用 <code>Gentoo</code> 和 <code>FreeBSD</code> 作为工作的主力系统，使用 <code>GNU Emacs</code> 作为代码编辑器、写作软件以及GTD软件。
</p>

<blockquote>
<p>
What's your favourite&#x2026;
</p>
<ol class="org-ol">
<li><p>
<b>operating system</b>
</p>

<p>
Gentoo.
</p></li>
<li><p>
<b>text editor</b>
</p>

<p>
GNU Emacs.
</p></li>
<li><p>
<b>programming language</b>
</p>

<p>
Bash for quick scripts; Perl for hacky scripts; Haskell for math &amp; FP; C for Universal.
</p></li>
<li><p>
<b>web browser</b>
</p>

<p>
Nyxt; Links; Firefox for compatibility.
</p></li>
<li><p>
<b>command-line shell</b>
</p>

<p>
Bash.
</p></li>
</ol>

<p>
i hope ure happy now <a href="https://sqt.wtf/~ullard/the-five-questions.html">ullard</a>.
</p>
</blockquote>

<p>
我使用 Dell Inspiron 7590 和一台 Thinkpad T480s 作为主力工作站，使用 <code>i3wm</code> 以及 <code>polybar</code> 。
</p>

<p>
我使用中文和英文写作。
</p>

<p>
我的个人邮箱是 <code>ilghar_kus [at] protonmail.com</code> 。欢迎你来信，当然推荐使用PGP进行加密。
</p>

<p>
我的PGP指纹为 <code>1A64866B328C6A9092F02DD11C360F7878D2377B</code> ， 你可以在<a href="./ilghar_kus.asc">这里</a>下载我的公钥。
</p>
</div>
</div>

<div id="outline-container-org47bf438" class="outline-2">
<h2 id="org47bf438">你可以在这里找到我</h2>
<div class="outline-text-2" id="text-org47bf438">
<ul class="org-ul">
<li><a href="https://gitlab.com/ilghar_kus">GitLab</a></li>
<li><a href="https://mastodon.sdf.org/@ika">Mastodon</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-04-29 Fri 16:40</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
